tutorials/compressible/rhoSimpleFoam/squareBend/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 110000;

boundaryField
{
    Default_Boundary_Region
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
        // type            mixed;
        refValue        uniform 110000;
        refGradient     uniform 0;
        valueFraction   uniform 0.3;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 110000;

        // type            mixed;
        // refValue        uniform 110000;
        // refGradient     uniform 0;
        // valueFraction   uniform 1;
        // type            transonicOutletPressure;
        // U               U;
        // phi             phi;
        // gamma           1.4;
        // psi             psi;
        // pInf            uniform 110000;
    }
}


// ************************************************************************* //
